src/cf/InformationRegisters/МоиДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МоиДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВМоиДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПричины</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РеестрЗадачПоИсполнителям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрЗадачПоИсполнителям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПриложения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидПриложенияЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСостоянияУчастниковЗадач</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьЗамещающие</Name>
					<Comment>Признак наличия замещающих по действию для отбора в списке задач</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПодзадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запланировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Истекает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПереносовСроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольныйСрокОбщий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Новое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПоступившихОбновлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилиОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченоИОжидаетВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУчастникаЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПриложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриложенийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоемкостьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоемкостьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МожетБытьПросрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеестрыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТекущиеСостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСостоянияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Действия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СведенияОПрочтении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПрочтении</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прочтен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВМоиДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВМоиДокументы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавленВручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенаЗадачаМне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаЗадачаОтМеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьАвторомДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьАвторомУтвержденияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьОтветственнымЗаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьПодписантомДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РезультатыПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодписано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыКорреспонденции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКорреспонденции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/МоиДокументы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр "Мои документы"
//
// Параметры:
//   Документ 	  - СправочникСсылка.ДокументыПредприятия - добавляемый документ 
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документ
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого добавляется документ,
//		   			если не указан, то текущий.
//   ИсточникПричины - ДокументСсылка.ДействиеЗадачи, ДокументСсылка.Задача - к какой задаче относится причина
//
Процедура ДобавитьЗаписьВМоиДокументы(Документ, Причина, Сотрудник = Неопределено,
	ИсточникПричины=Неопределено) Экспорт 
	
	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") 
		И ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.МоиДокументы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Причина = Причина;
	МенеджерЗаписи.Сотрудник = Сотрудник;
	МенеджерЗаписи.ИсточникПричины = ИсточникПричины;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

// Добавляет записи в регистр "Мои документы"
//
// Параметры:
//   Документы 	  - Массив - массив добавляемых документов
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документы
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого добавляется документ,
//   				если не указан, то текущий.
//
Процедура ДобавитьЗаписиВМоиДокументы(Документы, Причина, Сотрудник = Неопределено) Экспорт 

	Для Каждого Документ Из Документы цикл
		ДобавитьЗаписьВМоиДокументы(Документ, Причина, Сотрудник);
	КонецЦикла;	
	
КонецПроцедуры

// Удаляет запись из регистра "Мои документы"
//
// Параметры:
//   Документ 	  - СправочникСсылка.ДокументыПредприятия - удаляемый документ
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документы 
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого удаляется документ,
//   				если не указан, то текущий. 
//   ИсточникПричины - ДокументСсылка.ДействиеЗадачи, ДокументСсылка.Задача - к какой задаче относится причина
//
Процедура УдалитьЗаписьИзМоиДокументы(Документ, Причина, Знач Сотрудник = Неопределено,
	ИсточникПричины=Неопределено) Экспорт 
	
	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") 
		И ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	Если Причина = Перечисления.ПричиныДобавленияВМоиДокументы.НазначенаЗадачаМне 
		Или Причина = Перечисления.ПричиныДобавленияВМоиДокументы.ОтправленаЗадачаОтМеня Тогда
		
			НаборЗаписей = РегистрыСведений.МоиДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Документ);
			НаборЗаписей.Отбор.Причина.Установить(Причина);
			НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
			НаборЗаписей.Прочитать();
			
			КоличествоЗаписей = НаборЗаписей.Количество();
			Если КоличествоЗаписей = 0 Тогда
				Возврат;
			Иначе
				
				ЗаполнялсяИсточникПриСоздании = ЗначениеЗаполнено(НаборЗаписей[0].ИсточникПричины);
				
				Если ЗаполнялсяИсточникПриСоздании Тогда
					
					НаборЗаписей.Отбор.ИсточникПричины.Установить(ИсточникПричины); 
					НаборЗаписей.Прочитать();
					
				КонецЕсли;
				
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
				
			КонецЕсли;
		
	Иначе
		
		МенеджерЗаписи = РегистрыСведений.МоиДокументы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = Документ;
		МенеджерЗаписи.Причина = Причина;
		МенеджерЗаписи.Сотрудник = Сотрудник;
		МенеджерЗаписи.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписи.ИсточникПричины) Тогда
			МенеджерЗаписи.ИсточникПричины = ИсточникПричины; 
		КонецЕсли;
		
		МенеджерЗаписи.Удалить(); 
	
	КонецЕсли;
	
КонецПроцедуры

// Удаляет записи из регистра "Мои документы"
//
// Параметры:
//   Документы 	  - Массив - удаляемые документы
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документы
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого удаляется документ,
//   				если не указан, то текущий.
//
Процедура УдалитьЗаписиИзМоиДокументы(Документы, Причина, Сотрудник = Неопределено) Экспорт 
	
	Для Каждого Документ Из Документы Цикл
		УдалитьЗаписьИзМоиДокументы(Документ, Причина, Сотрудник);
	КонецЦикла;
	
КонецПроцедуры	

// Удаляет все записи по документу из регистра "Мои документы"
//
// Параметры:
//   Документ 		- СправочникСсылка.ДокументыПредприятия - удаляемый документ
//   Сотрудник   - СправочникСсылка.Сотрудники - Сотрудник, для которого удаляется документ,
//   				  если не указан, то текущий.
//
Процедура УдалитьДокументИзМоиДокументы(Документ, Сотрудник = Неопределено) Экспорт 

	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;
		
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") 
		И ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.МоиДокументы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Записать();
	
КонецПроцедуры	

// Проверяет, что переданный документ входит в "Мои документы"
//
// Параметры:
//   Документ 		- СправочникСсылка.ДокументыПредприятия - проверяемый документ
//   Сотрудник   - СправочникСсылка.Сотрудники - Сотрудник, для которого проверяется документ,
//   				  если не указан, то текущий.
// 
// Возвращаемое значение:
//  Булево
//
Функция ДокументВходитВМоиДокументы(Документ, Сотрудник = Неопределено) Экспорт 
	
	Если Сотрудник = Неопределено Тогда 
		СотрудникиПользователя = Сотрудники.ВсеСотрудникиТекущегоПользователя(Ложь);
	Иначе
		СотрудникиПользователя = Новый Массив;
		СотрудникиПользователя.Добавить(Сотрудник);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.МоиДокументы КАК МоиДокументы
		|ГДЕ
		|	МоиДокументы.Сотрудник В (&Сотрудники)
		|	И МоиДокументы.Документ = &Документ";
	Запрос.Параметры.Вставить("Сотрудники", СотрудникиПользователя);
	Запрос.Параметры.Вставить("Документ", Документ);
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

// Формирует временную таблицу "Мои документы".
// 
// Параметры:
//  Причины - Массив из ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы
// 
// Возвращаемое значение:
//  МенеджерВременныхТаблиц
// 
Функция ВременнаяТаблицаМоиДокументы(Причины) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МоиДокументы.Документ КАК Документ,
		|	МоиДокументы.Документ.Представление КАК ПредставлениеДокумента,
		|	МоиДокументы.Документ.СрокИсполнения КАК СрокИсполнения,
		|	МоиДокументы.Документ.ВидДокумента КАК ВидДокумента,
		|	МоиДокументы.Документ.Проект КАК Проект,
		|	ЕСТЬNULL(МоиДокументы.Документ.Проект.Представление, &ИмяГруппыБезПроекта) КАК Представление,
		|	ДанныеДокументовПредприятия.КонтрагентыДляСписков КАК Контрагент,
		|	ДанныеДокументовПредприятия.ДатаСортировки КАК ДатаДокумента,
		|	МоиДокументы.Причина КАК Причина,
		|	ТекущиеСостоянияДокументов.Состояние КАК СостояниеИсполнен,
		|	ВЫБОР
		|		КОГДА НЕ МоиДокументы.Документ.ВидДокумента.ЯвляетсяИсходящейКорреспонденцией
		|				И МоиДокументы.Документ.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				И МоиДокументы.Документ.СрокИсполнения < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|				И МоиДокументы.Документ.ВидДокумента.ИспользоватьСрокИсполнения
		|				И ТекущиеСостоянияДокументов.Состояние ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		КОГДА ТИПЗНАЧЕНИЯ(МоиДокументы.Документ) = ТИП(Справочник.ДокументыПредприятия)
		|				И МоиДокументы.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВМоиДокументы.ЯвляюсьПодписантомДокумента)
		|				И МоиДокументы.Документ.РезультатПодписания = ЗНАЧЕНИЕ(Перечисление.РезультатыПодписания.НеПодписано)
		|				И МоиДокументы.Документ.ДатаПодписания <> ДАТАВРЕМЯ(1, 1, 1)
		|				И МоиДокументы.Документ.ДатаПодписания < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|			ТОГДА ИСТИНА
		|		КОГДА МоиДокументы.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВМоиДокументы.НазначенаЗадачаМне)
		|				И ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						Документ.Задача.Приложения КАК ЗадачаПриложения
		|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрЗадачПоИсполнителям КАК РеестрЗадачПоИсполнителям
		|							ПО ЗадачаПриложения.Ссылка = РеестрЗадачПоИсполнителям.Задача
		|								И (РеестрЗадачПоИсполнителям.РеестрЗадач = &РеестрЗадачиМне)
		|								И (РеестрЗадачПоИсполнителям.ПросроченоИОжидаетВыполнения)
		|					ГДЕ
		|						ЗадачаПриложения.Приложение = МоиДокументы.Документ
		|						И НЕ РеестрЗадачПоИсполнителям.ДействиеЗадачи ЕСТЬ NULL)
		|			ТОГДА ИСТИНА
		|		КОГДА МоиДокументы.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВМоиДокументы.ОтправленаЗадачаОтМеня)
		|				И ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						Документ.Задача.Приложения КАК ЗадачаПриложения
		|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрЗадачПоИсполнителям КАК РеестрЗадачПоИсполнителям
		|							ПО ЗадачаПриложения.Ссылка = РеестрЗадачПоИсполнителям.Задача
		|								И (РеестрЗадачПоИсполнителям.РеестрЗадач = &РеестрЗадачиОтМеня)
		|								И (РеестрЗадачПоИсполнителям.ПросроченоИОжидаетВыполнения)
		|					ГДЕ
		|						ЗадачаПриложения.Приложение = МоиДокументы.Документ
		|						И НЕ РеестрЗадачПоИсполнителям.ДействиеЗадачи ЕСТЬ NULL)
		|			ТОГДА ИСТИНА
		|		КОГДА ТИПЗНАЧЕНИЯ(МоиДокументы.Документ) = ТИП(Справочник.ДокументыПредприятия)
		|				И МоиДокументы.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВМоиДокументы.ЯвляюсьПодписантомДокумента)
		|				И ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						Справочник.ДокументыПредприятия.Стороны КАК Стороны
		|					ГДЕ
		|						Стороны.Подписал В (&ПользовательИЕгоСотрудники)
		|						И НЕ Стороны.Подписан
		|						И Стороны.Ссылка = МоиДокументы.Документ
		|						И Стороны.ДатаПодписи <> ДАТАВРЕМЯ(1, 1, 1)
		|						И Стороны.ДатаПодписи < &ТекущаяДата)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Просрочен,
		|	ВЫБОР
		|		КОГДА &ИспользоватьПрочтенностьДокументов = ЛОЖЬ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ 	ЕСТЬNULL(СведенияОПрочтении.Прочтен, ЛОЖЬ)
		|	КОНЕЦ КАК Прочтен,
		|	МоиДокументы.Сотрудник,
		|	ВЫБОР
		|		КОГДА МоиДокументы.Документ.ВидДокумента.ЯвляетсяИсходящейКорреспонденцией
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыКорреспонденции.Исходящая)
		|		КОГДА МоиДокументы.Документ.ВидДокумента.ЯвляетсяВходящейКорреспонденцией
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыКорреспонденции.Входящая)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыКорреспонденции.ПустаяСсылка)
		|	КОНЕЦ КАК ВидКорреспонденции,
		|	(МоиДокументы.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВМоиДокументы.ЯвляюсьАвторомДокумента)
		|		ИЛИ МоиДокументы.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВМоиДокументы.ЯвляюсьОтветственнымЗаДокумент))
		|	И МоиДокументы.Документ.НеДействует = ЛОЖЬ
		|	И (МоиДокументы.Документ.ДатаОкончанияДействия >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|				И МоиДокументы.Документ.ДатаОкончанияДействия <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2), ДЕНЬ)
		|			ИЛИ МоиДокументы.Документ.СрокИсполнения >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|				И МоиДокументы.Документ.СрокИсполнения <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2), ДЕНЬ)) КАК Истекает
		|
		|ПОМЕСТИТЬ МоиДокументы
		|ИЗ
		|	РегистрСведений.МоиДокументы КАК МоиДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДокументовПредприятия КАК ДанныеДокументовПредприятия
		|		ПО МоиДокументы.Документ = ДанныеДокументовПредприятия.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеСостоянияДокументов КАК ТекущиеСостоянияДокументов
		|		ПО МоиДокументы.Документ = ТекущиеСостоянияДокументов.Документ
		|			И (ТекущиеСостоянияДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Исполнен))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрочтении КАК СведенияОПрочтении
		|		ПО МоиДокументы.Документ = СведенияОПрочтении.Объект
		|			И (СведенияОПрочтении.Пользователь = &Пользователь)
		|ГДЕ
		|	НЕ МоиДокументы.Документ.ПометкаУдаления
		|	И МоиДокументы.Сотрудник В (&Сотрудники)
		|	И МоиДокументы.Причина В(&Причины)");
	
	// При отсутствии прав на проекты считаем проект пустым.
	ЧастьТекстаЗапросаПроектов =
		"	МоиДокументы.Документ.Проект КАК Проект,
		|	ЕСТЬNULL(МоиДокументы.Документ.Проект.Представление, &ИмяГруппыБезПроекта) КАК Представление,";
	Если Не СтрНайти(Запрос.Текст, ЧастьТекстаЗапросаПроектов) Тогда
		// Запрос всегда должен быть в консистентном состоянии с данной частью текста запроса.
		ВызватьИсключение НСтр("ru = 'Не найден текста запроса проектов.'");
	КонецЕсли;
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Проекты) Тогда
		ЧастьТекстаЗапросаБезПроектов =
			"	Значение(Справочник.Проекты.ПустаяСсылка) КАК Проект,
			|	&ИмяГруппыБезПроекта КАК Представление,";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ЧастьТекстаЗапросаПроектов, ЧастьТекстаЗапросаБезПроектов);
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники.ВсеСотрудникиТекущегоПользователя(Ложь));
	Запрос.УстановитьПараметр("ПользовательИЕгоСотрудники", Сотрудники.ПользовательИЕгоСотрудники(, Ложь));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Причины", Причины);
	Запрос.УстановитьПараметр("ИмяГруппыБезПроекта", НСтр("ru = 'Без проекта'"));
	
	Запрос.УстановитьПараметр("ИспользоватьПрочтенностьДокументов", 
		ПолучитьФункциональнуюОпцию("ИспользоватьПрочтенностьДокументов"));
	
	РеестрЗадачиМне = Справочники.РеестрыЗадач.РеестрЗадачиМне(ТекущийПользователь);
	Запрос.УстановитьПараметр("РеестрЗадачиМне", РеестрЗадачиМне);
	
	РеестрЗадачиОтМеня = Справочники.РеестрыЗадач.РеестрЗадачиОтМеня(ТекущийПользователь);
	Запрос.УстановитьПараметр("РеестрЗадачиОтМеня", РеестрЗадачиОтМеня);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

#КонецОбласти
